In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from Own_package import Data_Analysis
import importlib
importlib.reload(Data_Analysis)

In [5]:
# df_all ( it's the whole dataframe)
# most_package ( has the most common package [175.0, 190.0) ) including [ 175  & not including 190 )
# monthly_sales_growth
# Monthly_package ( the most sales package on monthly basis based on quantity )

In [6]:
df_all = pd.read_csv("Full_data_cleaned.csv")

In [7]:
df_all.head()

,Date,Store_Nbr,Lylty_Card_Nbr,Txn_Id,Prod_Nbr,Prod_Qty,Tot_Sales,Package_Size,Brand,Flavor,Premium_Customer,Age_Stage,Marital,Fam
0,2018-10-17,1,1000,1,5,2,6.0,175.0,Natural Chip Compny,Seasalt,Premium,Young,Singles,Couples
1,2018-08-17,10,10000,9020,9,1,4.6,150.0,Kettle,Ricotta,Budget,Young,Singles,Couples
2,2018-09-02,10,10000,9021,95,2,3.4,90.0,French,Oniondip,Budget,Young,Singles,Couples
3,2018-11-10,10,10000,9022,106,2,6.0,175.0,Natural Chip Compny,Chicken,Budget,Young,Singles,Couples
4,2018-08-30,100,100000,98306,114,2,9.2,150.0,Kettle,Siracha Lime,Mainstream,Retirees,Unknown,Unknown

In [8]:
# Changing the data types from int to String
df_all[['Store_Nbr','Lylty_Card_Nbr','Txn_Id','Prod_Nbr']] = df_all[['Store_Nbr','Lylty_Card_Nbr','Txn_Id','Prod_Nbr']].astype(str)

In [9]:
# descriptive analysis for the numeric columns
for i in df_all.columns:
    if np.issubdtype(df_all[i].dtypes , np.number):
        print(f"Column Name = {df_all[i].name} ")
        print(Data_Analysis.gen_stats(df_all[i]))
        print("#"*50)

Column Name = Prod_Qty
Mean                                            1.907309
Median                                               2.0
Std                                             0.643654
Min                                                  1.0
Max                                                200.0
Q1                                                   2.0
Q3                                                   2.0
IQR                                                  0.0
Lower_Outlier                                        2.0
Upper_Outlier                                        2.0
Values below outlier                               27518
Values above outlier                                1279
Total count of values                             264836
z_score > 1                                         1279
z_score > 2                                          849
z_score > 3                                          849
MAD Z-Robust-Score                                   0.0
Z-Robust-Score > 1       Not applciable mad = 0 or None
Z-Robust-Score > 2       Not applciable mad = 0 or None
Z-Robust-Score > 3       Not applciable mad = 0 or None
dtype: object
##################################################
Column Name = Tot_Sales
Mean                          7.0
Median                        7.0
Std                           3.0
Min                           2.0
Max                         650.0
Q1                            5.0
Q3                            9.0
IQR                           4.0
Lower_Outlier                -0.0
Upper_Outlier                15.0
Values below outlier          0.0
Values above outlier        578.0
Total count of values    264836.0
z_score > 1               35171.0
z_score > 2                 712.0
z_score > 3                 439.0
MAD Z-Robust-Score            2.0
Z-Robust-Score > 1        88701.0
Z-Robust-Score > 2         5828.0
Z-Robust-Score > 3          507.0
dtype: float64
##################################################
Column Name = Package_Size
Mean                                          183.017532
Median                                             170.0
Std                                            64.507022
Min                                                 70.0
Max                                                380.0
Q1                                                 150.0
Q3                                                 175.0
IQR                                                 25.0
Lower_Outlier                                      112.5
Upper_Outlier                                      212.5
Values below outlier                               26902
Values above outlier                               45142
Total count of values                             264836
z_score > 1                                        43578
z_score > 2                                        18958
z_score > 3                                         6418
MAD Z-Robust-Score                                   NaN
Z-Robust-Score > 1       Not applciable mad = 0 or None
Z-Robust-Score > 2       Not applciable mad = 0 or None
Z-Robust-Score > 3       Not applciable mad = 0 or None
dtype: object
##################################################

In [10]:
# to devide the package_size column into intervals 
bins_size = 15
bins = np.arange(df_all.Package_Size.min() , df_all.Package_Size.max()+bins_size, bins_size)
df_all['package_bins'] = pd.cut(df_all.Package_Size , bins=bins , right=False)

In [11]:
# the most frequent bin 
df_all['package_bins'].value_counts()

package_bins
[175.0, 190.0)    67858
[145.0, 160.0)    43131
[160.0, 175.0)    38250
[130.0, 145.0)    25102
[100.0, 115.0)    22387
[295.0, 310.0)    15166
[325.0, 340.0)    12540
[190.0, 205.0)     7468
[370.0, 385.0)     6418
[265.0, 280.0)     6285
[205.0, 220.0)     6272
[250.0, 265.0)     3169
[85.0, 100.0)      3008
[220.0, 235.0)     1564
[70.0, 85.0)       1507
[115.0, 130.0)     1454
[280.0, 295.0)        0
[235.0, 250.0)        0
[310.0, 325.0)        0
[340.0, 355.0)        0
[355.0, 370.0)        0
Name: count, dtype: int64

In [12]:
# New table that contains the most frequent interval from 175 to less than 190 
most_package = df_all[df_all.package_bins == pd.Interval(175.0 , 190.0 , closed = 'left')].copy()

In [13]:
# Most Age_Stage to buy the most frequent package from 175.0 , 190.0
most_package.Age_Stage.value_counts()

Age_Stage
Older       26451
Young       20482
Retirees    12700
Midage       6453
New          1772
Name: count, dtype: int64

In [14]:
# Most Premium_Customer to buy the most frequent package from 175.0 , 190.0
most_package.Premium_Customer.value_counts()

Premium_Customer
Mainstream    25664
Budget        24135
Premium       18059
Name: count, dtype: int64

In [15]:
# Most Marital to buy the most frequent package from 175.0 , 190.0
most_package.Marital.value_counts()

Marital
Singles     29469
Families    25689
Unknown     12700
Name: count, dtype: int64

In [16]:
# grouping 'Age_Stage','Marital' & the most frequent package from 175.0 , 190.0 value_counts
most_package.groupby(['Age_Stage','Marital'])['package_bins'].value_counts().reset_index(name = 'Total').query('Total > 0').sort_values('Total',ascending=False)

    Age_Stage   Marital    package_bins  Total
147     Older   Singles  [175.0, 190.0)  13900
231  Retirees   Unknown  [175.0, 190.0)  12700
126     Older  Families  [175.0, 190.0)  12551
252     Young  Families  [175.0, 190.0)  11366
273     Young   Singles  [175.0, 190.0)   9116
21     Midage   Singles  [175.0, 190.0)   6453
63        New  Families  [175.0, 190.0)   1772

In [17]:
# Most 5 Brands has sales ?
Data_Analysis.top_n(df_all,['Brand'],'Tot_Sales')

      Brand  Total_of_Tot_Sales
0    Kettle            390239.8
1   Doritos            241890.9
2    Smiths            224660.2
3  Pringles            184486.5
4     Thins            124751.5

In [18]:
# Most 5 Flavors has sales ?
Data_Analysis.top_n(df_all,['Flavor'],'Tot_Sales')

         Flavor  Total_of_Tot_Sales
0       Chicken            407946.7
1    Sour Cream            206193.9
2      Original            199400.9
3  Tomato Salsa            134953.6
4       Vinegar            133478.6

In [19]:
# most package size has been sold ?
df_all.groupby('package_bins',observed=True)['Prod_Qty'].sum()\
    .reset_index(name = 'Total Quantity').sort_values('Total Quantity' , ascending = False).reset_index(drop=True).head(5)

     package_bins  Total Quantity
0  [175.0, 190.0)          129231
1  [145.0, 160.0)           82174
2  [160.0, 175.0)           72743
3  [130.0, 145.0)           48019
4  [100.0, 115.0)           42835

In [20]:
# most quantity has been sold from which brand ? 
df_all.groupby('Brand')['Prod_Qty'].sum()\
    .reset_index(name='Total Quantity Sold').sort_values('Total Quantity Sold' , ascending = False).reset_index(drop=True).head(5)
Data_Analysis.top_n(df_all,'Brand','Prod_Qty', mode='count', n=5)

      Brand  Count
0    Kettle  41288
1    Smiths  31823
2   Doritos  28147
3  Pringles  26666
4     Thins  18664

In [21]:
# most quantity has been sold from which flavour ?
df_all.groupby('Flavor')['Prod_Qty'].sum()\
    .reset_index(name='Total Quantity Sold').sort_values('Total Quantity Sold' , ascending = False).reset_index(drop=True).head(5)

         Flavor  Total Quantity Sold
0       Chicken               114139
1    Sour Cream                56304
2      Original                49954
3       Seasalt                34990
4  Tomato Salsa                34669

In [22]:
# Changing the date column's data type to DATE 
df_all['Date'] = pd.to_datetime(df_all.Date)

In [23]:
# monthly sales growth
monthly_sales_growth = df_all.groupby(df_all.Date.dt.month)['Tot_Sales'].sum()
monthly_sales_growth.pct_change()*100

Date
1           NaN
2     -7.364197
3     10.354230
4     -3.861361
5     -1.549907
6      2.014995
7      2.950505
8     -3.959606
9      1.128292
10     2.425649
11    -2.543553
12     4.792812
Name: Tot_Sales, dtype: float64

In [24]:
# monthly Quantity growth
monthly_quantity_growth = df_all.groupby(df_all.Date.dt.month)['Prod_Qty'].sum()
monthly_quantity_growth.pct_change()*100

Date
1           NaN
2     -7.719818
3     10.522693
4     -3.511200
5     -1.255230
6      1.336562
7      3.321227
8     -4.065492
9      0.742455
10     2.462194
11    -2.162490
12     4.654493
Name: Prod_Qty, dtype: float64

In [25]:
# which store has the most sales monthly 
Data_Analysis.top_n(df_all,['Store_Nbr'],'Tot_Sales')

  Store_Nbr  Total_of_Tot_Sales
0       226            18905.45
1        88            16333.25
2       165            15973.75
3        40            15559.50
4       237            15539.50

In [26]:
# sales by store & brand 
Data_Analysis.top_n(df_all,['Store_Nbr','Brand'],'Prod_Qty',n = 10)

  Store_Nbr    Brand  Total_of_Prod_Qty
0       226  Doritos                919
1       226   Kettle                875
2        88   Kettle                848
3       165   Kettle                831
4        40   Kettle                802
5        58   Kettle                789
6        26   Kettle                787
7       199   Kettle                781
8       237   Kettle                769
9         4   Kettle                762

In [27]:
# Most package bin sold as per quantity on monthly basis 
Monthly_package = df_all.groupby([df_all.Date.dt.month,'package_bins'],observed = True)['Prod_Qty'].sum()\
    .reset_index(name = 'Total Quantity Sold').sort_values( 'Total Quantity Sold' , ascending = False).head(12).reset_index(drop=True).copy()
Monthly_package.sort_values(by = 'Date',ascending = True).reset_index(drop=True)

    Date    package_bins  Total Quantity Sold
0      1  [175.0, 190.0)                10628
1      2  [175.0, 190.0)                 9970
2      3  [175.0, 190.0)                10998
3      4  [175.0, 190.0)                10851
4      5  [175.0, 190.0)                10382
5      6  [175.0, 190.0)                11016
6      7  [175.0, 190.0)                11332
7      8  [175.0, 190.0)                10467
8      9  [175.0, 190.0)                10785
9     10  [175.0, 190.0)                10879
10    11  [175.0, 190.0)                10525
11    12  [175.0, 190.0)                11398

In [28]:
# 
Data_Analysis.top_n(df_all,['Premium_Customer','Age_Stage','Marital','Fam'],'Tot_Sales')

  Premium_Customer Age_Stage   Marital      Fam  Total_of_Tot_Sales
0           Budget     Older  Families  Unknown           168363.25
1       Mainstream     Young   Singles  Couples           157621.60
2       Mainstream  Retirees   Unknown  Unknown           155677.05
3           Budget     Young  Families  Unknown           139345.85
4           Budget     Older   Singles  Couples           136769.80

In [29]:
#  
Data_Analysis.top_n(df_all,['Premium_Customer','Age_Stage','Marital','Fam'],'Prod_Qty')

  Premium_Customer Age_Stage   Marital      Fam  Total_of_Prod_Qty
0           Budget     Older  Families  Unknown              45065
1       Mainstream  Retirees   Unknown  Unknown              40518
2       Mainstream     Young   Singles  Couples              38632
3           Budget     Young  Families  Unknown              37111
4           Budget     Older   Singles  Couples              35220

In [30]:
df_all.query("Brand == 'Ccs'")['Tot_Sales'].sum()

18078.9

In [75]:
df_all.head()

,Date,Store_Nbr,Lylty_Card_Nbr,Txn_Id,Prod_Nbr,Prod_Qty,Tot_Sales,Package_Size,Brand,Flavor,Premium_Customer,Age_Stage,Marital,Fam,package_bins
0,2018-10-17,1,1000,1,5,2,6.0,175.0,Natural Chip Compny,Seasalt,Premium,Young,Singles,Couples,"[175.0, 190.0)"
1,2018-08-17,10,10000,9020,9,1,4.6,150.0,Kettle,Ricotta,Budget,Young,Singles,Couples,"[145.0, 160.0)"
2,2018-09-02,10,10000,9021,95,2,3.4,90.0,French,Oniondip,Budget,Young,Singles,Couples,"[85.0, 100.0)"
3,2018-11-10,10,10000,9022,106,2,6.0,175.0,Natural Chip Compny,Chicken,Budget,Young,Singles,Couples,"[175.0, 190.0)"
4,2018-08-30,100,100000,98306,114,2,9.2,150.0,Kettle,Siracha Lime,Mainstream,Retirees,Unknown,Unknown,"[145.0, 160.0)"